app/controllers/admin/tasks_controller.rb

SELECT `tasks`.* FROM `tasks`
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (24, 3, 4, 12, 28, 38, 30, 11, 23, 17, 18, 39, 46, 7, 6, 2, 32, 14, 49, 35, 45, 44, 25, 10, 34, 21, 33, 47, 8, 48, 36, 42, 40, 5, 9, 41, 27, 20, 1, 37, 15, 43, 16, 13, 29)
---
	def index
		@create_assign_user = true
		@tasks = Task.includes(:user).all

UPDATE `tasks` SET user_id = 7 WHERE `tasks`.`id` IN (1, 2)
---
	def assign_users
		tasks = Task.where(:id=> params["task"]["task_id"].split(',').uniq)
		tasks.update_all("user_id = #{params['task']['user_id']}")